Table of Contents
 Class ProjectItem
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
Identification of an item in the Idea project
[DataContract]
public class ProjectItem
Inheritance
object
ProjectItem
Derived
CrossSectionProjectItem
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Properties
 Identifier
Id of the item in the idea project
[DataMember]
public int Identifier { get; set; }
Property Value
int
 Name
Name of the item in the idea project
[DataMember]
public string Name { get; set; }
Property Value
string
 Edit this page